Autodesk.Revit.DB.AdaptivePointConstraintType
An enumerated type containing possible constraint types for Adaptive Points.
Since:
2012

Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_Z
Constrained to the Z Axis (x=0, y=0).

Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_Y
Constrained to the Y Axis (x=0, z=0).

Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_X
Constrained to the X Axis (y=0, z=0).

Autodesk.Revit.DB.AdaptivePointConstraintType.Plane_XY
Constrained to the XY Plane (z=0).

Autodesk.Revit.DB.AdaptivePointConstraintType.Plane_ZX
Constrained to the ZX Plane (y=0).

Autodesk.Revit.DB.AdaptivePointConstraintType.Plane_YZ
Constrained to the YZ Plane (x=0).

Autodesk.Revit.DB.AdaptivePointConstraintType.None
Not constrained.